# My Pandas Notes

In [2]:
import pandas as pd
import numpy as np

### Series

In [195]:
data = pd.Series([0.25, 0.5, 0.75, 1.0], index=["a", "b", "c", "d"])

In [133]:
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [134]:
data.values

array([0.25, 0.5 , 0.75, 1.  ])

In [135]:
data.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [136]:
data.shape

(4,)

In [137]:
labels_list = ["Can", "Tan", "Alice", "Eddie", "Joe"]

In [138]:
data_list = [10, 20, 30, 40, 50]

In [139]:
pd.Series(data_list, labels_list)

Can      10
Tan      20
Alice    30
Eddie    40
Joe      50
dtype: int64

In [140]:
data_set = np.array([1, 53, 54, 2, 7, 6])
labels = ["A", "B", "C", "D", "E", "F"]
pd.Series(data_set, labels)

A     1
B    53
C    54
D     2
E     7
F     6
dtype: int32

In [141]:
data_Dict = {"Ankara":53, "Istanbul":76, "San Francisco":23, "London":34}
pd.Series(data_Dict)

Ankara           53
Istanbul         76
San Francisco    23
London           34
dtype: int64

In [142]:
pd.Series(data=data_set, index=labels)

A     1
B    53
C    54
D     2
E     7
F     6
dtype: int32

### Data Frames

In [143]:
data = pd.DataFrame(data=np.array([[5,5,2],[4,3,5],[5,6,6]]), index=range(len(np.array([[5,5,2],[4,3,5],[5,6,6]]))), columns=["A","B","C"])
data

   A  B  C
0  5  5  2
1  4  3  5
2  5  6  6

In [144]:
data["A"]

0    5
1    4
2    5
Name: A, dtype: int32

In [145]:
type(data["A"])

pandas.core.series.Series

In [146]:
data.loc[0]

A    5
B    5
C    2
Name: 0, dtype: int32

In [147]:
data["D"] = pd.Series(data=np.array([9, 8, 9]), index=range(len(data)))

In [148]:
data

   A  B  C  D
0  5  5  2  9
1  4  3  5  8
2  5  6  6  9

In [149]:
data["E"] = data["A"] + data["B"] + data["C"]

In [150]:
data

   A  B  C  D   E
0  5  5  2  9  12
1  4  3  5  8  12
2  5  6  6  9  17

In [151]:
data.drop("D", axis=1)

   A  B  C   E
0  5  5  2  12
1  4  3  5  12
2  5  6  6  17

In [152]:
data

   A  B  C  D   E
0  5  5  2  9  12
1  4  3  5  8  12
2  5  6  6  9  17

In [153]:
data.iloc[0]

A     5
B     5
C     2
D     9
E    12
Name: 0, dtype: int32

In [154]:
data.loc[[0,2],["A","D"]]

   A  D
0  5  9
2  5  9

In [155]:
data.iloc[::2, ::2]

   A  C   E
0  5  2  12
2  5  6  17

In [156]:
data

   A  B  C  D   E
0  5  5  2  9  12
1  4  3  5  8  12
2  5  6  6  9  17

In [157]:
data > 5

       A      B      C     D     E
0  False  False  False  True  True
1  False  False  False  True  True
2  False   True   True  True  True

In [158]:
data[data>5]

    A    B    C  D   E
0 NaN  NaN  NaN  9  12
1 NaN  NaN  NaN  8  12
2 NaN  6.0  6.0  9  17

In [159]:
data["A"] > 4

0     True
1    False
2     True
Name: A, dtype: bool

In [160]:
data[data["A"] > 4]

   A  B  C  D   E
0  5  5  2  9  12
2  5  6  6  9  17

In [161]:
data = pd.DataFrame(data=np.random.randn(6,5), index=range(6), columns=["C1", "C2", "C3", "C4", "C6"])

In [162]:
data

         C1        C2        C3        C4        C6
0  0.162473  0.790022  1.504212 -0.022392  1.658318
1  1.341643  1.532391 -0.489567 -0.080097 -0.017171
2 -1.303619 -0.618224 -1.427380  0.462672  0.621688
3  0.697839 -0.790479 -0.222287  0.961708  1.492024
4 -0.534583  1.705542  0.074327  0.768090 -2.268476
5 -0.103959  0.514825 -0.209752  0.251134 -0.655529

In [163]:
data["column_for_index"] = ["val1", "val2", "val3", "val4", "val5", "val6"]

In [164]:
data

         C1        C2        C3        C4        C6 column_for_index
0  0.162473  0.790022  1.504212 -0.022392  1.658318             val1
1  1.341643  1.532391 -0.489567 -0.080097 -0.017171             val2
2 -1.303619 -0.618224 -1.427380  0.462672  0.621688             val3
3  0.697839 -0.790479 -0.222287  0.961708  1.492024             val4
4 -0.534583  1.705542  0.074327  0.768090 -2.268476             val5
5 -0.103959  0.514825 -0.209752  0.251134 -0.655529             val6

In [165]:
data.set_index("column_for_index")

                        C1        C2        C3        C4        C6
column_for_index
val1              0.162473  0.790022  1.504212 -0.022392  1.658318
val2              1.341643  1.532391 -0.489567 -0.080097 -0.017171
val3             -1.303619 -0.618224 -1.427380  0.462672  0.621688
val4              0.697839 -0.790479 -0.222287  0.961708  1.492024
val5             -0.534583  1.705542  0.074327  0.768090 -2.268476
val6             -0.103959  0.514825 -0.209752  0.251134 -0.655529

In [166]:
data

         C1        C2        C3        C4        C6 column_for_index
0  0.162473  0.790022  1.504212 -0.022392  1.658318             val1
1  1.341643  1.532391 -0.489567 -0.080097 -0.017171             val2
2 -1.303619 -0.618224 -1.427380  0.462672  0.621688             val3
3  0.697839 -0.790479 -0.222287  0.961708  1.492024             val4
4 -0.534583  1.705542  0.074327  0.768090 -2.268476             val5
5 -0.103959  0.514825 -0.209752  0.251134 -0.655529             val6

In [167]:
data.set_index("column_for_index", inplace=True)

In [168]:
data

                        C1        C2        C3        C4        C6
column_for_index
val1              0.162473  0.790022  1.504212 -0.022392  1.658318
val2              1.341643  1.532391 -0.489567 -0.080097 -0.017171
val3             -1.303619 -0.618224 -1.427380  0.462672  0.621688
val4              0.697839 -0.790479 -0.222287  0.961708  1.492024
val5             -0.534583  1.705542  0.074327  0.768090 -2.268476
val6             -0.103959  0.514825 -0.209752  0.251134 -0.655529

In [169]:
data = pd.DataFrame(data=np.random.randn(6,5), index=range(6), columns=["C1", "C2", "C3", "C4", "C6"])
data["column_for_index"] = ["val1", "val2", "val3", "val4", "val5", "val6"]
data

         C1        C2        C3        C4        C6 column_for_index
0 -1.594535  0.560825 -0.244908 -0.569466  0.957316             val1
1  0.572411  0.398556  0.253152 -0.063583  0.629905             val2
2 -0.910400 -1.683656 -1.613918 -1.055590  0.122998             val3
3  1.416199  0.513227  1.725479  0.917594  0.920885             val4
4 -1.050948  0.248396  0.028555 -1.160978  1.283698             val5
5 -0.312038  0.533764 -1.769893 -1.832763 -2.451350             val6

In [170]:
data.set_index("column_for_index", inplace=True, drop=False)

In [171]:
data

,C1,C2,C3,C4,C6,column_for_index
column_for_index,,,,,,
val1,-1.594535,0.560825,-0.244908,-0.569466,0.957316,val1
val2,0.572411,0.398556,0.253152,-0.063583,0.629905,val2
val3,-0.910400,-1.683656,-1.613918,-1.055590,0.122998,val3
val4,1.416199,0.513227,1.725479,0.917594,0.920885,val4
val5,-1.050948,0.248396,0.028555,-1.160978,1.283698,val5
val6,-0.312038,0.533764,-1.769893,-1.832763,-2.451350,val6

In [172]:
data = pd.DataFrame(data=np.random.randn(6,5), index=range(6), columns=["C1", "C2", "C3", "C4", "C6"])
data["column_for_index"] = ["val1", "val2", "val3", "val4", "val5", "val6"]
data.set_index("column_for_index", inplace=True, drop=False, append=True)

In [173]:
data

,,C1,C2,C3,C4,C6,column_for_index
,column_for_index,,,,,,
0,val1,-0.346057,-0.516687,0.755857,-0.008635,-0.972018,val1
1,val2,-0.129320,-1.074616,-0.745009,-0.507632,-1.098665,val2
2,val3,0.927154,0.328616,1.700989,0.096023,-0.116542,val3
3,val4,0.729548,2.868703,0.965983,0.146662,0.068229,val4
4,val5,0.369813,-0.477449,0.935648,-0.384295,2.097214,val5
5,val6,-1.483896,-1.213252,0.814582,-1.092235,0.655962,val6

### Multi Indexing

In [174]:
groups = ["Group1", "Group2", "Group3"]*3
groups.sort()
groups

['Group1',
 'Group1',
 'Group1',
 'Group2',
 'Group2',
 'Group2',
 'Group3',
 'Group3',
 'Group3']

In [175]:
trying_something = [1]*5 + [2]*5 + [3]*5
trying_something

[1, 1, 1, 1, 1, 2, 2, 2, 2, 2, 3, 3, 3, 3, 3]

In [176]:
inner_indexes = ["index1", "index2", "index3"] * 3
inner_indexes

['index1',
 'index2',
 'index3',
 'index1',
 'index2',
 'index3',
 'index1',
 'index2',
 'index3']

In [177]:
hierarchy = list(zip(groups, inner_indexes))
hierarchy

[('Group1', 'index1'),
 ('Group1', 'index2'),
 ('Group1', 'index3'),
 ('Group2', 'index1'),
 ('Group2', 'index2'),
 ('Group2', 'index3'),
 ('Group3', 'index1'),
 ('Group3', 'index2'),
 ('Group3', 'index3')]

In [178]:
the_data_list = np.random.randn(9,3)
the_data_list

array([[-1.10397871,  1.53795748, -0.00863136],
       [ 0.31004957,  0.177768  ,  0.01575237],
       [ 1.75577881,  1.26380094,  0.37475307],
       [-0.32254465,  0.17173861, -0.33979404],
       [ 1.48993636, -1.26226422,  0.04378035],
       [ 1.54824521,  0.25651729,  0.87730799],
       [ 1.23213706, -0.04170018, -1.74123476],
       [ 0.48802393,  0.01727172,  0.24792657],
       [-2.82230663,  2.32632667, -1.33632677]])

In [179]:
hierarchy = pd.MultiIndex.from_tuples(hierarchy)

In [180]:
df = pd.DataFrame(data=the_data_list, index=hierarchy, columns=["column1", "column2", "column3"])

In [181]:
df

                column1   column2   column3
Group1 index1 -1.103979  1.537957 -0.008631
       index2  0.310050  0.177768  0.015752
       index3  1.755779  1.263801  0.374753
Group2 index1 -0.322545  0.171739 -0.339794
       index2  1.489936 -1.262264  0.043780
       index3  1.548245  0.256517  0.877308
Group3 index1  1.232137 -0.041700 -1.741235
       index2  0.488024  0.017272  0.247927
       index3 -2.822307  2.326327 -1.336327

In [182]:
df["column1"]

Group1  index1   -1.103979
        index2    0.310050
        index3    1.755779
Group2  index1   -0.322545
        index2    1.489936
        index3    1.548245
Group3  index1    1.232137
        index2    0.488024
        index3   -2.822307
Name: column1, dtype: float64

In [183]:
df.loc["Group1"]

         column1   column2   column3
index1 -1.103979  1.537957 -0.008631
index2  0.310050  0.177768  0.015752
index3  1.755779  1.263801  0.374753

In [184]:
df.loc[["Group1", "Group2"]]

                column1   column2   column3
Group1 index1 -1.103979  1.537957 -0.008631
       index2  0.310050  0.177768  0.015752
       index3  1.755779  1.263801  0.374753
Group2 index1 -0.322545  0.171739 -0.339794
       index2  1.489936 -1.262264  0.043780
       index3  1.548245  0.256517  0.877308

In [185]:
df.loc["Group1"].loc["index1"]

column1   -1.103979
column2    1.537957
column3   -0.008631
Name: index1, dtype: float64

In [186]:
df.loc["Group1"].loc["index1"]["column1"]

-1.1039787135925894

In [187]:
df.index.names

FrozenList([None, None])

In [188]:
df.index.names = ["Groups", "Indexes"]

In [189]:
df

                 column1   column2   column3
Groups Indexes
Group1 index1  -1.103979  1.537957 -0.008631
       index2   0.310050  0.177768  0.015752
       index3   1.755779  1.263801  0.374753
Group2 index1  -0.322545  0.171739 -0.339794
       index2   1.489936 -1.262264  0.043780
       index3   1.548245  0.256517  0.877308
Group3 index1   1.232137 -0.041700 -1.741235
       index2   0.488024  0.017272  0.247927
       index3  -2.822307  2.326327 -1.336327

#### .xs METHOD LIKE A .loc METHOD

In [190]:
df.xs("Group1")

          column1   column2   column3
Indexes
index1  -1.103979  1.537957 -0.008631
index2   0.310050  0.177768  0.015752
index3   1.755779  1.263801  0.374753

In [191]:
df.xs("Group1").xs("index1")

column1   -1.103979
column2    1.537957
column3   -0.008631
Name: index1, dtype: float64

In [192]:
df.xs("Group1").xs("index1").xs("column1")

-1.1039787135925894

In [193]:
# index1 values for each groups...

df.xs("index1", level="Indexes")

         column1   column2   column3
Groups
Group1 -1.103979  1.537957 -0.008631
Group2 -0.322545  0.171739 -0.339794
Group3  1.232137 -0.041700 -1.741235

### Missing Values

In [198]:
data = np.array([[1, 2, 5], [2, np.nan, np.nan], [7, 1, np.nan]])
data

array([[ 1.,  2.,  5.],
       [ 2., nan, nan],
       [ 7.,  1., nan]])

In [226]:
df = pd.DataFrame(data=data, index=["index1", "index2", "index3"], columns=["col1", "col2", "col3"])
df

        col1  col2  col3
index1   1.0   2.0   5.0
index2   2.0   NaN   NaN
index3   7.0   1.0   NaN

In [227]:
df.dropna()
#### Default value of the axis parameter is "0". Axis=0 => x - axis

        col1  col2  col3
index1   1.0   2.0   5.0

In [228]:
df.dropna(axis=1)

        col1
index1   1.0
index2   2.0
index3   7.0

In [229]:
df.dropna(thresh=2)
# Indicates at least how many non-NaN values will be in an index.

        col1  col2  col3
index1   1.0   2.0   5.0
index3   7.0   1.0   NaN

In [230]:
df.dropna(thresh=1)

        col1  col2  col3
index1   1.0   2.0   5.0
index2   2.0   NaN   NaN
index3   7.0   1.0   NaN

In [231]:
df.dropna(thresh=3)

        col1  col2  col3
index1   1.0   2.0   5.0

In [232]:
df.dropna(thresh=4)

Empty DataFrame
Columns: [col1, col2, col3]
Index: []

In [233]:
df.fillna(value=1)

        col1  col2  col3
index1   1.0   2.0   5.0
index2   2.0   1.0   1.0
index3   7.0   1.0   1.0

In [234]:
df.fillna(value=100)

        col1   col2   col3
index1   1.0    2.0    5.0
index2   2.0  100.0  100.0
index3   7.0    1.0  100.0

In [235]:
df.fillna(value=150)

        col1   col2   col3
index1   1.0    2.0    5.0
index2   2.0  150.0  150.0
index3   7.0    1.0  150.0

In [237]:
df.sum()

col1    10.0
col2     3.0
col3     5.0
dtype: float64

In [238]:
df.sum().sum()

18.0

In [283]:
######### How many value is not NaN? #########
df.size # Total number of values

18

In [248]:
df.isnull().sum().sum() # Total number of NaN values

3

In [249]:
a = df.size - df.isnull().sum().sum()
a

6

In [250]:
avg_value = df.sum().sum() / a
avg_value

3.0

In [254]:
df.fillna(value=avg_value, inplace=True)

In [255]:
df

        col1  col2  col3
index1   1.0   2.0   5.0
index2   2.0   3.0   3.0
index3   7.0   1.0   3.0

### GroupBy Query

In [261]:
dataset = {"Department":["IT", "Human Resources", "Production", "Production", "IT", "Human Resources"],
           "Active":["Maria", "Joe", "Ali", "Jenny", "Carlos", "April"],
           "Salary":[3000, 3500, 2500, 4500, 4000, 2000]}

In [262]:
df = pd.DataFrame(data=dataset)
df

        Department  Active  Salary
0               IT   Maria    3000
1  Human Resources     Joe    3500
2       Production     Ali    2500
3       Production   Jenny    4500
4               IT  Carlos    4000
5  Human Resources   April    2000

In [264]:
DepGroup = df.groupby("Department")
DepGroup

In [265]:
DepGroup.sum()

                 Salary
Department
Human Resources    5500
IT                 7000
Production         7000

In [266]:
DepGroup.sum().loc["IT"]

Salary    7000
Name: IT, dtype: int64

In [267]:
int(DepGroup.sum().loc["IT"])

7000

In [271]:
df.groupby("Department").count()

                 Active  Salary
Department
Human Resources       2       2
IT                    2       2
Production            2       2

In [272]:
df.groupby("Department").max()

                Active  Salary
Department
Human Resources    Joe    3500
IT               Maria    4000
Production       Jenny    4500

In [273]:
df.groupby("Department").min()

                 Active  Salary
Department
Human Resources   April    2000
IT               Carlos    3000
Production          Ali    2500

In [275]:
df.groupby("Department").min().iloc[:,1:]

                 Salary
Department
Human Resources    2000
IT                 3000
Production         2500

In [276]:
df.groupby("Department").min()["Salary"]

Department
Human Resources    2000
IT                 3000
Production         2500
Name: Salary, dtype: int64

In [277]:
df.groupby("Department").min()["Salary"]["IT"]

3000

In [279]:
df.groupby("Department").mean()

                 Salary
Department
Human Resources    2750
IT                 3500
Production         3500

In [281]:
df.groupby("Department").mean()["Salary"]

Department
Human Resources    2750
IT                 3500
Production         3500
Name: Salary, dtype: int64

In [282]:
df.groupby("Department").mean()["Salary"]["Human Resources"]

2750

### Concatenation

In [286]:
dataset1 = {
    "A": ["A1", "A2", "A3", "A4"],
    "B": ["B1", "B2", "B3", "B4"],
    "C": ["C1", "C2", "C3", "C4"],
}
dataset2 = {
    "A": ["A5", "A6", "A7", "A8"],
    "B": ["B5", "B6", "B7", "B8"],
    "C": ["C5", "C6", "C7", "C8"],
}
df1 = pd.DataFrame(dataset1, index=range(1,5))
df2 = pd.DataFrame(dataset2, index=range(5,9))

In [287]:
df1

    A   B   C
1  A1  B1  C1
2  A2  B2  C2
3  A3  B3  C3
4  A4  B4  C4

In [288]:
df2

    A   B   C
5  A5  B5  C5
6  A6  B6  C6
7  A7  B7  C7
8  A8  B8  C8

In [291]:
pd.concat([df1, df2], axis=0)

    A   B   C
1  A1  B1  C1
2  A2  B2  C2
3  A3  B3  C3
4  A4  B4  C4
5  A5  B5  C5
6  A6  B6  C6
7  A7  B7  C7
8  A8  B8  C8

In [292]:
pd.concat([df1, df2], axis=1)

     A    B    C    A    B    C
1   A1   B1   C1  NaN  NaN  NaN
2   A2   B2   C2  NaN  NaN  NaN
3   A3   B3   C3  NaN  NaN  NaN
4   A4   B4   C4  NaN  NaN  NaN
5  NaN  NaN  NaN   A5   B5   C5
6  NaN  NaN  NaN   A6   B6   C6
7  NaN  NaN  NaN   A7   B7   C7
8  NaN  NaN  NaN   A8   B8   C8

### Join

In [304]:
######  join on indexes ######

In [305]:
dataset1 = {
    "A": ["A1", "A2", "A3", "A4"],
    "B": ["B1", "B2", "B3", "B4"],
}
dataset2 = {
    "X": ["X1", "X2", "X3"],
    "Y": ["Y1", "Y2", "Y3"],
}
df1 = pd.DataFrame(dataset1, index=range(1,5))
df2 = pd.DataFrame(dataset2, index=range(1,4))

In [306]:
df1

    A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4

In [307]:
df2

    X   Y
1  X1  Y1
2  X2  Y2
3  X3  Y3

In [308]:
df1.join(df2)

    A   B    X    Y
1  A1  B1   X1   Y1
2  A2  B2   X2   Y2
3  A3  B3   X3   Y3
4  A4  B4  NaN  NaN

In [309]:
df1.join(df2, how="right")

    A   B   X   Y
1  A1  B1  X1  Y1
2  A2  B2  X2  Y2
3  A3  B3  X3  Y3

In [310]:
df2.join(df1)

    X   Y   A   B
1  X1  Y1  A1  B1
2  X2  Y2  A2  B2
3  X3  Y3  A3  B3

In [311]:
df2.join(df1, how="right")

     X    Y   A   B
1   X1   Y1  A1  B1
2   X2   Y2  A2  B2
3   X3   Y3  A3  B3
4  NaN  NaN  A4  B4

### Merge

In [312]:
###### join on columns ######

In [313]:
dataset1 = {
    "A": ["A1", "A2", "A3"],
    "B": ["B1", "B2", "B3"],
    "key": ["K1", "K2", "K3"]
}
dataset2 = {
    "X": ["X1", "X2", "X3", "X4"],
    "Y": ["Y1", "Y2", "Y3", "Y4"],
    "key": ["K1", "K2", "K5", "K4"]
}
df1 = pd.DataFrame(dataset1, index=range(1, 4))
df2 = pd.DataFrame(dataset2, index=range(1, 5))

In [314]:
df1

    A   B key
1  A1  B1  K1
2  A2  B2  K2
3  A3  B3  K3

In [315]:
df2

    X   Y key
1  X1  Y1  K1
2  X2  Y2  K2
3  X3  Y3  K5
4  X4  Y4  K4

In [317]:
pd.merge(df1, df2, on="key")

    A   B key   X   Y
0  A1  B1  K1  X1  Y1
1  A2  B2  K2  X2  Y2

### DataFrame Operations

In [44]:
df = pd.DataFrame({
    "column1":[1, 2, 3, 4, 5, 6],
    "column2":[100, 100, 200, 300, 300, 100],
    "column3":["Clara", "Mert", "Berk", "Maria", "David", "Seren"]
})
df

   column1  column2 column3
0        1      100   Clara
1        2      100    Mert
2        3      200    Berk
3        4      300   Maria
4        5      300   David
5        6      100   Seren

In [6]:
df.head() # Default parameter is n=5 and shown first n=5 rows...

   column1  column2 column3
0        1      100   Clara
1        2      100    Mert
2        3      200    Berk
3        4      300   Maria
4        5      300   David

In [7]:
df.head(n=2)

   column1  column2 column3
0        1      100   Clara
1        2      100    Mert

In [8]:
df.tail() # Default parameter is n=5 and shown last n=5 rows...

   column1  column2 column3
1        2      100    Mert
2        3      200    Berk
3        4      300   Maria
4        5      300   David
5        6      100   Seren

In [9]:
df.tail(n=2)

   column1  column2 column3
4        5      300   David
5        6      100   Seren

In [10]:
df["column2"].unique() # Shown unique values of stated columns...

array([100, 200, 300], dtype=int64)

In [11]:
df["column2"].nunique() # Shown the number of unique values at stated columns...

3

In [12]:
df["column2"].value_counts()

100    3
300    2
200    1
Name: column2, dtype: int64

In [14]:
df[(df["column1"] >= 4) & (df["column2"] == 300)]

   column1  column2 column3
3        4      300   Maria
4        5      300   David

In [17]:
#### APPLY FUNCTION ####

In [24]:
df["column2"]*3

0    300
1    300
2    600
3    900
4    900
5    300
Name: column2, dtype: int64

In [45]:
def times_3(x):
    return x * 3

df["column2"] = df["column2"].apply(times_3)
df

   column1  column2 column3
0        1      300   Clara
1        2      300    Mert
2        3      600    Berk
3        4      900   Maria
4        5      900   David
5        6      300   Seren

In [26]:
df["column3"]

0    Clara
1     Mert
2     Berk
3    Maria
4    David
5    Seren
Name: column3, dtype: object

In [29]:
df["column3"].apply(len) ### Embedded functions can also be used.

0    5
1    4
2    4
3    5
4    5
5    5
Name: column3, dtype: int64

In [46]:
df.drop("column3", axis=1, inplace=True)
df

   column1  column2
0        1      300
1        2      300
2        3      600
3        4      900
4        5      900
5        6      300

In [47]:
df.columns

Index(['column1', 'column2'], dtype='object')

In [48]:
df.index

RangeIndex(start=0, stop=6, step=1)

In [49]:
len(df.index)

6

In [50]:
df.index.names

FrozenList([None])

In [54]:
df.sort_values("column2") #### min to max

   column1  column2
0        1      300
1        2      300
5        6      300
2        3      600
3        4      900
4        5      900

In [55]:
df.sort_values("column2", ascending=False) #### max to min

   column1  column2
3        4      900
4        5      900
2        3      600
0        1      300
1        2      300
5        6      300

### Pivot Tables

In [59]:
df = pd.DataFrame({
    "Month": ["March", "April", "May", "March", "April", "May", "March", "April", "May"],
    "City" : ["Ankara", "Ankara", "Ankara", "Istanbul", "Istanbul", "Istanbul", "Izmir", "Izmir", "Izmir"],
    "Humidity" : [10, 25, 50, 21, 67, 80, 30, 70, 75]
})
df

   Month      City  Humidity
0  March    Ankara        10
1  April    Ankara        25
2    May    Ankara        50
3  March  Istanbul        21
4  April  Istanbul        67
5    May  Istanbul        80
6  March     Izmir        30
7  April     Izmir        70
8    May     Izmir        75

In [60]:
df.pivot_table(index="Month", columns="City", values="Humidity")

City   Ankara  Istanbul  Izmir
Month
April      25        67     70
March      10        21     30
May        50        80     75